11/data/attachments/a8334b3fe49440b1.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_c3b3d69a-4e2f-4150-a823-a60f5c39cb40</nif:username>
            <nif:friendToBeAdded>Timothy_risk_Friend_78139_2</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>